tic%计时�?��
%第二色到第七�? 穿料长度不相等的情况
clear;clc;
% close all;

L1=6.56;%穿料长度（m�?
L2=7.08;
L3=6.08;
L4=7.91;
L5=7.33;
L6=6.89;

C=0.68;%印刷版辊周长（m�?r=0.1083(m)
V=100/60;%印刷速度（m/s�?

a1=V/L1;a2=V/L2;a3=V/L3;a4=V/L4;a5=V/L5;a6=V/L6;%(1/s)

Ts=C/V;%采样周期（s�?

Nr1=round(L1/C);Nr2=round(L2/C);Nr3=round(L3/C);%
Nr4=round(L4/C);Nr5=round(L5/C);Nr6=round(L6/C);

r=C/(3.14159*2);%印刷版辊半径(m)
%线�?系统系数
A=[1-1/Nr1 0 0 0 0 0;
   0 1-1/Nr2 0 0 0 0;
   0 0 1-1/Nr3 0 0 0;
   0 0 0 1-1/Nr4 0 0;
   0 0 0 0 1-1/Nr5 0;
   0 0 0 0 0 1-1/Nr6];
B=[r/Nr1 0 0 0 0 0;
   0 r/Nr2 0 0 0 0;
   0 0 r/Nr3 0 0 0;
   0 0 0 r/Nr4 0 0;
   0 0 0 0 r/Nr5 0;
   0 0 0 0 0 r/Nr6];
%初始误差�?
e0=[300;0;0;0;0;0];%0.01mm
%预测步长
Np=5;
%优化目标参数，加权矩�?
Q=[1 0 0 0 0 0;
   0 1 0 0 0 0;  
   0 0 1 0 0 0;
   0 0 0 1 0 0;
   0 0 0 0 1 0;
   0 0 0 0 0 1];
R=[1 0 0 0 0 0;
   0 1 0 0 0 0;
   0 0 1 0 0 0;
   0 0 0 1 0 0;
   0 0 0 0 1 0;
   0 0 0 0 0 1];
%转化为用控制量ut表示的，关于误差量的推导方程的矩�?
At=[];Bt=[];temp=[];
%转换后的加权矩阵
Qt=[];Rt=[];


%传�?函数
G=tf([1],[1]);%当前色组自身MPC控制�?
U=c2d(G,Ts);
G=tf([1,0],[1,a1]);%第二色对后续色组的解耦补偿传递函�?
U2=c2d(G,Ts);
G=tf([1,0],[1,a2]);%第三色对后续色组的解耦补偿传递函�?
U3=c2d(G,Ts);
G=tf([1,0],[1,a3]);%第四色对后续色组的解耦补偿传递函�?
U4=c2d(G,Ts);
G=tf([1,0],[1,a4]);%第五色对后续色组的解耦补偿传递函�?
U5=c2d(G,Ts);
G=tf([1,0],[1,a5]);%第六色对后续色组的解耦补偿传递函�?
U6=c2d(G,Ts);

G=tf([a2*r],[1,a2]);%第三色误�?
G3=c2d(G,Ts);
G=tf([r*a1*a2],[1,a1+a2,a1*a2]);
G321=c2d(G,Ts);
G=tf([r*a2],[1,a2]);
G322=c2d(G,Ts);

G=tf([r*a3],[1,a3]);%第四色误�?
G4=c2d(G,Ts);
G=tf([r*a1*a2*a3],[1,a1+a2+a3,a1*a2+a1*a3+a2*a3,a1*a2*a3]);
G421=c2d(G,Ts);
G=tf([r*a2*a3],[1,a2+a3,a2*a3]);
G422=c2d(G,Ts);
G=tf([r*a2*a3],[1,a2+a3,a2*a3]);
G431=c2d(G,Ts);
G=tf([r*a3],[1,a3]);
G432=c2d(G,Ts);

G=tf([r*a4],[1,a4]);%第五色误�?
G5=c2d(G,Ts);
G=tf([r*a1*a2*a3*a4],[1,a1+a2+a3+a4,a1*a2+a1*a3+a1*a4+a2*a3+a2*a4+a3*a4,a1*a2*a3+a1*a2*a4+a1*a3*a4+a2*a3*a4,a1*a2*a3*a4]);
G521=c2d(G,Ts);
G=tf([r*a2*a3*a4],[1,a2+a3+a4,a2*a3+a2*a4+a3*a4,a2*a3*a4]);
G522=c2d(G,Ts);
G=tf([r*a2*a3*a4],[1,a2+a3+a4,a2*a3+a2*a4+a3*a4,a2*a3*a4]);
G531=c2d(G,Ts);
G=tf([r*a3*a4],[1,a3+a4,a3*a4]);
G532=c2d(G,Ts);
G=tf([r*a3*a4],[1,a3+a4,a3*a4]);
G541=c2d(G,Ts);
G=tf([r*a4],[1,a4]);
G542=c2d(G,Ts);

G=tf([r*a5],[1,a5]);%第六色误�?
G6=c2d(G,Ts);
G=tf([r*a1*a2*a3*a4*a5],[1,a1+a2+a3+a4+a5,a1*a2+a1*a3+a1*a4+a1*a5+a2*a3+a2*a4+a2*a5+a3*a4+a3*a5+a4*a5,a1*a2*a3+a1*a2*a4+a1*a2*a5+a1*a3*a4+a1*a3*a5+a1*a4*a5+a2*a3*a4+a2*a3*a5+a2*a4*a5+a3*a4*a5,a1*a2*a3*a4+a1*a2*a3*a5+a1*a2*a4*a5+a2*a3*a4*a5+a1*a3*a4*a5,a1*a2*a3*a4*a5]);
G621=c2d(G,Ts);
G=tf([r*a2*a3*a4*a5],[1,a2+a3+a4+a5,a2*a3+a2*a4+a2*a5+a3*a4+a3*a5+a4*a5,a2*a3*a4+a2*a3*a5+a2*a4*a5+a3*a4*a5,a2*a3*a4*a5]);
G622=c2d(G,Ts);
G=tf([r*a2*a3*a4*a5],[1,a2+a3+a4+a5,a2*a3+a2*a4+a2*a5+a3*a4+a3*a5+a4*a5,a2*a3*a4+a2*a3*a5+a2*a4*a5+a3*a4*a5,a2*a3*a4*a5]);
G631=c2d(G,Ts);
G=tf([r*a3*a4*a5],[1,a3+a4+a5,a3*a4+a3*a5+a4*a5,a3*a4*a5]);
G632=c2d(G,Ts);
G=tf([r*a3*a4*a5],[1,a3+a4+a5,a3*a4+a3*a5+a4*a5,a3*a4*a5]);
G641=c2d(G,Ts);
G=tf([r*a4*a5],[1,a4+a5,a4*a5]);
G642=c2d(G,Ts);
G=tf([r*a4*a5],[1,a4+a5,a4*a5]);
G651=c2d(G,Ts);
G=tf([r*a5],[1,a5]);
G652=c2d(G,Ts);

G=tf([r*a6],[1,a6]);%第七色误�?
G7=c2d(G,Ts);
G=tf([r*a1*a2*a3*a4*a5*a6],[1,a1+a2+a3+a4+a5+a6,a1*a2+a1*a3+a1*a4+a1*a5+a1*a6+a2*a3+a2*a4+a2*a5+a2*a6+a3*a4+a3*a5+a3*a6+a4*a5+a4*a6+a5*a6,a1*a2*a3+a1*a2*a4+a1*a2*a5+a1*a2*a6+a1*a3*a4+a1*a3*a5+a1*a3*a6+a1*a4*a5+a1*a4*a6+a1*a5*a6+a2*a3*a4+a2*a3*a5+a2*a3*a6+a2*a4*a5+a2*a4*a6+a2*a5*a6+a3*a4*a5+a3*a4*a6+a3*a5*a6+a4*a5*a6,a1*a2*a3*a4+a1*a2*a3*a5+a1*a2*a3*a6+a1*a2*a4*a5+a1*a2*a4*a6+a1*a2*a5*a6+a1*a3*a4*a5+a1*a3*a4*a6+a1*a3*a5*a6+a1*a4*a5*a6+a2*a3*a4*a5+a2*a3*a4*a6+a2*a3*a5*a6+a2*a4*a5*a6+a3*a4*a5*a6,a1*a2*a3*a4*a5+a1*a2*a3*a4*a6+a1*a2*a3*a5*a6+a1*a2*a4*a5*a6+a1*a3*a4*a5*a6+a2*a3*a4*a5*a6,a1*a2*a3*a4*a5*a6]);
G721=c2d(G,Ts);
G=tf([r*a2*a3*a4*a5*a6],[1,a2+a3+a4+a5+a6,a2*a3+a2*a4+a2*a5+a2*a6+a3*a4+a3*a5+a3*a6+a4*a5+a4*a6+a5*a6,a2*a3*a4+a2*a3*a5+a2*a3*a6+a2*a4*a5+a2*a4*a6+a2*a5*a6+a3*a4*a5+a3*a4*a6+a3*a5*a6+a4*a5*a6,a2*a3*a4*a5+a2*a3*a4*a6+a2*a3*a5*a6+a2*a4*a5*a6+a3*a4*a5*a6,a2*a3*a4*a5*a6]);
G722=c2d(G,Ts);
G=tf([r*a2*a3*a4*a5*a6],[1,a2+a3+a4+a5+a6,a2*a3+a2*a4+a2*a5+a2*a6+a3*a4+a3*a5+a3*a6+a4*a5+a4*a6+a5*a6,a2*a3*a4+a2*a3*a5+a2*a3*a6+a2*a4*a5+a2*a4*a6+a2*a5*a6+a3*a4*a5+a3*a4*a6+a3*a5*a6+a4*a5*a6,a2*a3*a4*a5+a2*a3*a4*a6+a2*a3*a5*a6+a2*a4*a5*a6+a3*a4*a5*a6,a2*a3*a4*a5*a6]);
G731=c2d(G,Ts);
G=tf([r*a3*a4*a5*a6],[1,a3+a4+a5+a6,a3*a4+a3*a5+a3*a6+a4*a5+a4*a6+a5*a6,a3*a4*a5+a3*a4*a6+a3*a5*a6+a4*a5*a6,a3*a4*a5*a6]);
G732=c2d(G,Ts);
G=tf([r*a3*a4*a5*a6],[1,a3+a4+a5+a6,a3*a4+a3*a5+a3*a6+a4*a5+a4*a6+a5*a6,a3*a4*a5+a3*a4*a6+a3*a5*a6+a4*a5*a6,a3*a4*a5*a6]);
G741=c2d(G,Ts);
G=tf([r*a4*a5*a6],[1,a4+a5+a6,a4*a5+a4*a6+a5*a6,a4*a5*a6]);
G742=c2d(G,Ts);
G=tf([r*a4*a5*a6],[1,a4+a5+a6,a4*a5+a4*a6+a5*a6,a4*a5*a6]);
G751=c2d(G,Ts);
G=tf([r*a5*a6],[1,a5+a6,a5*a6]);
G752=c2d(G,Ts);
G=tf([r*a5*a6],[1,a5+a6,a5*a6]);
G761=c2d(G,Ts);
G=tf([r*a6],[1,a6]);
G762=c2d(G,Ts);


%加权矩阵的计算过程，以及推导方程矩阵的叠加过�?
for i=1:Np
    At=[At;A^i];
    Bt=[Bt zeros(size(Bt,1),size(B,2));
        A^(i-1)*B temp];
    temp=[A^(i-1)*B temp];
    
    Qt=[Qt zeros(size(Qt,1),size(Q,1));
        zeros(size(Q,1),size(Qt,1)) Q];
    Rt=[Rt zeros(size(Rt,1),size(R,1));
        zeros(size(R,1),size(Rt,1)) R];
end
%控制量ut的初始�?
u0=zeros(6*Np,1);%0.01mm
%转换后的优化目标函数系数矩阵，循环优化函数中H后的表达式为优化目标的另�?��
H=2*(Bt'*Qt*Bt+Rt);
u21(1:3)=0;%第二色的MPC控制�?
u2(1:3)=0;%第二色的实际控制�?
u31(1:3)=0;%第三色的MPC控制�?
u3(1:3)=0;%第三色的实际控制�?
u41(1:3)=0;%第四色的MPC控制�?
u4(1:3)=0;%第四色的实际控制�?
u51(1:3)=0;%第五色的MPC控制�?
u5(1:3)=0;%第五色的实际控制�?
u61(1:3)=0;%第六色的MPC控制�?
u6(1:3)=0;%第六色的实际控制�?
u71(1:3)=0;%第七色的MPC控制�?
u7(1:3)=0;%第七色的实际控制�?

u2b(1:3)=0;%对第二色的补偿量
u3b(1:3)=0;
u4b(1:3)=0;
u5b(1:3)=0;
u6b(1:3)=0;

w2(1:3)=0;%第二色原本的MPC控制量（不加积分�?
w3(1:3)=0;
w4(1:3)=0;
w5(1:3)=0;
w6(1:3)=0;
w7(1:3)=0;


e2(1:3)=e0(1,:);%第二色实际误�?
e3(1:3,1)=e0(2,:);%第三色实际误�?
e4(1:3,1)=e0(3,:);%第四色实际误�?
e5(1:3,1)=e0(4,:);%第五色实际误�?
e6(1:3,1)=e0(5,:);%第六色实际误�?
e7(1:3,1)=e0(6,:);%第七色实际误�?
ek=e0;

for k = 3:200
    t = 0:Ts:Ts*(k-1);

% 3.根据�?��控制量序列简化出的公式，计算出ut
    K1=r*(5*Nr1^9 - 25*Nr1^8 + 20*Nr1^7*r^2 + 70*Nr1^7 - 80*Nr1^6*r^2 - 130*Nr1^6 + 21*Nr1^5*r^4 + 162*Nr1^5*r^2 + 166*Nr1^5 - 63*Nr1^4*r^4 - 206*Nr1^4*r^2 - 148*Nr1^4 + 8*Nr1^3*r^6 + 87*Nr1^3*r^4 + 170*Nr1^3*r^2 + 91*Nr1^3 - 16*Nr1^2*r^6 - 69*Nr1^2*r^4 - 90*Nr1^2*r^2 - 37*Nr1^2 + Nr1*r^8 + 12*Nr1*r^6 + 30*Nr1*r^4 + 28*Nr1*r^2 + 9*Nr1 - r^8 - 4*r^6 - 6*r^4 - 4*r^2 - 1)/(Nr1^10 + 15*Nr1^8*r^2 - 40*Nr1^7*r^2 + 35*Nr1^6*r^4 + 80*Nr1^6*r^2 - 84*Nr1^5*r^4 - 108*Nr1^5*r^2 + 28*Nr1^4*r^6 + 126*Nr1^4*r^4 + 103*Nr1^4*r^2 - 48*Nr1^3*r^6 - 116*Nr1^3*r^4 - 68*Nr1^3*r^2 + 9*Nr1^2*r^8 + 48*Nr1^2*r^6 + 69*Nr1^2*r^4 + 30*Nr1^2*r^2 - 8*Nr1*r^8 - 24*Nr1*r^6 - 24*Nr1*r^4 - 8*Nr1*r^2 + r^10 + 4*r^8 + 6*r^6 + 4*r^4 + r^2);
	K2=r*(5*Nr2^9 - 25*Nr2^8 + 20*Nr2^7*r^2 + 70*Nr2^7 - 80*Nr2^6*r^2 - 130*Nr2^6 + 21*Nr2^5*r^4 + 162*Nr2^5*r^2 + 166*Nr2^5 - 63*Nr2^4*r^4 - 206*Nr2^4*r^2 - 148*Nr2^4 + 8*Nr2^3*r^6 + 87*Nr2^3*r^4 + 170*Nr2^3*r^2 + 91*Nr2^3 - 16*Nr2^2*r^6 - 69*Nr2^2*r^4 - 90*Nr2^2*r^2 - 37*Nr2^2 + Nr2*r^8 + 12*Nr2*r^6 + 30*Nr2*r^4 + 28*Nr2*r^2 + 9*Nr2 - r^8 - 4*r^6 - 6*r^4 - 4*r^2 - 1)/(Nr2^10 + 15*Nr2^8*r^2 - 40*Nr2^7*r^2 + 35*Nr2^6*r^4 + 80*Nr2^6*r^2 - 84*Nr2^5*r^4 - 108*Nr2^5*r^2 + 28*Nr2^4*r^6 + 126*Nr2^4*r^4 + 103*Nr2^4*r^2 - 48*Nr2^3*r^6 - 116*Nr2^3*r^4 - 68*Nr2^3*r^2 + 9*Nr2^2*r^8 + 48*Nr2^2*r^6 + 69*Nr2^2*r^4 + 30*Nr2^2*r^2 - 8*Nr2*r^8 - 24*Nr2*r^6 - 24*Nr2*r^4 - 8*Nr2*r^2 + r^10 + 4*r^8 + 6*r^6 + 4*r^4 + r^2);
	K3=r*(5*Nr3^9 - 25*Nr3^8 + 20*Nr3^7*r^2 + 70*Nr3^7 - 80*Nr3^6*r^2 - 130*Nr3^6 + 21*Nr3^5*r^4 + 162*Nr3^5*r^2 + 166*Nr3^5 - 63*Nr3^4*r^4 - 206*Nr3^4*r^2 - 148*Nr3^4 + 8*Nr3^3*r^6 + 87*Nr3^3*r^4 + 170*Nr3^3*r^2 + 91*Nr3^3 - 16*Nr3^2*r^6 - 69*Nr3^2*r^4 - 90*Nr3^2*r^2 - 37*Nr3^2 + Nr3*r^8 + 12*Nr3*r^6 + 30*Nr3*r^4 + 28*Nr3*r^2 + 9*Nr3 - r^8 - 4*r^6 - 6*r^4 - 4*r^2 - 1)/(Nr3^10 + 15*Nr3^8*r^2 - 40*Nr3^7*r^2 + 35*Nr3^6*r^4 + 80*Nr3^6*r^2 - 84*Nr3^5*r^4 - 108*Nr3^5*r^2 + 28*Nr3^4*r^6 + 126*Nr3^4*r^4 + 103*Nr3^4*r^2 - 48*Nr3^3*r^6 - 116*Nr3^3*r^4 - 68*Nr3^3*r^2 + 9*Nr3^2*r^8 + 48*Nr3^2*r^6 + 69*Nr3^2*r^4 + 30*Nr3^2*r^2 - 8*Nr3*r^8 - 24*Nr3*r^6 - 24*Nr3*r^4 - 8*Nr3*r^2 + r^10 + 4*r^8 + 6*r^6 + 4*r^4 + r^2);
	K4=r*(5*Nr4^9 - 25*Nr4^8 + 20*Nr4^7*r^2 + 70*Nr4^7 - 80*Nr4^6*r^2 - 130*Nr4^6 + 21*Nr4^5*r^4 + 162*Nr4^5*r^2 + 166*Nr4^5 - 63*Nr4^4*r^4 - 206*Nr4^4*r^2 - 148*Nr4^4 + 8*Nr4^3*r^6 + 87*Nr4^3*r^4 + 170*Nr4^3*r^2 + 91*Nr4^3 - 16*Nr4^2*r^6 - 69*Nr4^2*r^4 - 90*Nr4^2*r^2 - 37*Nr4^2 + Nr4*r^8 + 12*Nr4*r^6 + 30*Nr4*r^4 + 28*Nr4*r^2 + 9*Nr4 - r^8 - 4*r^6 - 6*r^4 - 4*r^2 - 1)/(Nr4^10 + 15*Nr4^8*r^2 - 40*Nr4^7*r^2 + 35*Nr4^6*r^4 + 80*Nr4^6*r^2 - 84*Nr4^5*r^4 - 108*Nr4^5*r^2 + 28*Nr4^4*r^6 + 126*Nr4^4*r^4 + 103*Nr4^4*r^2 - 48*Nr4^3*r^6 - 116*Nr4^3*r^4 - 68*Nr4^3*r^2 + 9*Nr4^2*r^8 + 48*Nr4^2*r^6 + 69*Nr4^2*r^4 + 30*Nr4^2*r^2 - 8*Nr4*r^8 - 24*Nr4*r^6 - 24*Nr4*r^4 - 8*Nr4*r^2 + r^10 + 4*r^8 + 6*r^6 + 4*r^4 + r^2);
	K5=r*(5*Nr5^9 - 25*Nr5^8 + 20*Nr5^7*r^2 + 70*Nr5^7 - 80*Nr5^6*r^2 - 130*Nr5^6 + 21*Nr5^5*r^4 + 162*Nr5^5*r^2 + 166*Nr5^5 - 63*Nr5^4*r^4 - 206*Nr5^4*r^2 - 148*Nr5^4 + 8*Nr5^3*r^6 + 87*Nr5^3*r^4 + 170*Nr5^3*r^2 + 91*Nr5^3 - 16*Nr5^2*r^6 - 69*Nr5^2*r^4 - 90*Nr5^2*r^2 - 37*Nr5^2 + Nr5*r^8 + 12*Nr5*r^6 + 30*Nr5*r^4 + 28*Nr5*r^2 + 9*Nr5 - r^8 - 4*r^6 - 6*r^4 - 4*r^2 - 1)/(Nr5^10 + 15*Nr5^8*r^2 - 40*Nr5^7*r^2 + 35*Nr5^6*r^4 + 80*Nr5^6*r^2 - 84*Nr5^5*r^4 - 108*Nr5^5*r^2 + 28*Nr5^4*r^6 + 126*Nr5^4*r^4 + 103*Nr5^4*r^2 - 48*Nr5^3*r^6 - 116*Nr5^3*r^4 - 68*Nr5^3*r^2 + 9*Nr5^2*r^8 + 48*Nr5^2*r^6 + 69*Nr5^2*r^4 + 30*Nr5^2*r^2 - 8*Nr5*r^8 - 24*Nr5*r^6 - 24*Nr5*r^4 - 8*Nr5*r^2 + r^10 + 4*r^8 + 6*r^6 + 4*r^4 + r^2);
	K6=r*(5*Nr6^9 - 25*Nr6^8 + 20*Nr6^7*r^2 + 70*Nr6^7 - 80*Nr6^6*r^2 - 130*Nr6^6 + 21*Nr6^5*r^4 + 162*Nr6^5*r^2 + 166*Nr6^5 - 63*Nr6^4*r^4 - 206*Nr6^4*r^2 - 148*Nr6^4 + 8*Nr6^3*r^6 + 87*Nr6^3*r^4 + 170*Nr6^3*r^2 + 91*Nr6^3 - 16*Nr6^2*r^6 - 69*Nr6^2*r^4 - 90*Nr6^2*r^2 - 37*Nr6^2 + Nr6*r^8 + 12*Nr6*r^6 + 30*Nr6*r^4 + 28*Nr6*r^2 + 9*Nr6 - r^8 - 4*r^6 - 6*r^4 - 4*r^2 - 1)/(Nr6^10 + 15*Nr6^8*r^2 - 40*Nr6^7*r^2 + 35*Nr6^6*r^4 + 80*Nr6^6*r^2 - 84*Nr6^5*r^4 - 108*Nr6^5*r^2 + 28*Nr6^4*r^6 + 126*Nr6^4*r^4 + 103*Nr6^4*r^2 - 48*Nr6^3*r^6 - 116*Nr6^3*r^4 - 68*Nr6^3*r^2 + 9*Nr6^2*r^8 + 48*Nr6^2*r^6 + 69*Nr6^2*r^4 + 30*Nr6^2*r^2 - 8*Nr6*r^8 - 24*Nr6*r^6 - 24*Nr6*r^4 - 8*Nr6*r^2 + r^10 + 4*r^8 + 6*r^6 + 4*r^4 + r^2);
		
    ut(1)=-ek(1)*K1;
    ut(2)=-ek(2)*K2;
    ut(3)=-ek(3)*K3;
    ut(4)=-ek(4)*K4;
    ut(5)=-ek(5)*K5;
    ut(6)=-ek(6)*K6;

    %采用优化得到的MPC控制量ut的第�?��元素作为第二色实际作用的MPC控制量，第二个元素作为第三色实际作用的MPC控制量，
    %分别根据得到MPC控制量算出实际控制量（补偿量+MPC控制量）
    %将实际控制量代入实际系统得到实际误差
    %再将实际误差继续二次优化出下�?��刻的MPC控制量ut
    u21(k)=ut(1);%第二色MPC控制�?
    u31(k)=ut(2);%第三色MPC控制�?
    u41(k)=ut(3);
    u51(k)=ut(4);
    u61(k)=ut(5);
    u71(k)=ut(6);
    

    w2(k)=(u21(k)-u21(k-1));%第二色原本的MPC控制量（不加积分�?
    w3(k)=(u31(k)-u31(k-1));%第三色原本的MPC控制量（不加积分�?
    w4(k)=(u41(k)-u41(k-1));
    w5(k)=(u51(k)-u51(k-1));
    w6(k)=(u61(k)-u61(k-1));
    w7(k)=(u71(k)-u71(k-1));
    
    u2b(k)=(1-1/Nr1)*u2b(k-1)+w2(k)-w2(k-1);%对第二色补偿量计�?
    u3b(k)=(1-1/Nr2)*u3b(k-1)+w3(k)-w3(k-1);
    u4b(k)=(1-1/Nr3)*u4b(k-1)+w4(k)-w4(k-1);
    u5b(k)=(1-1/Nr4)*u5b(k-1)+w5(k)-w5(k-1);
    u6b(k)=(1-1/Nr5)*u6b(k-1)+w6(k)-w6(k-1);
    
    u2(k)=w2(k);%第二色实际控制量
    u3(k)=w3(k)+u2b(k);%第三色实际控制量
    u4(k)=w4(k)+u2b(k)+u3b(k);
    u5(k)=w5(k)+u2b(k)+u3b(k)+u4b(k);
    u6(k)=w6(k)+u2b(k)+u3b(k)+u4b(k)+u5b(k);
    u7(k)=w7(k)+u2b(k)+u3b(k)+u4b(k)+u5b(k)+u6b(k);
    
%     u3=lsim(U,u31(1:k),t)+lsim(U2,u2(1:k),t);%第三色实际控制量
%     u4=lsim(U,u41(1:k),t)+lsim(U2,u2(1:k),t)+lsim(U3,u31(1:k),t);%第四色实际控制量
%     u5=lsim(U,u51(1:k),t)+lsim(U2,u2(1:k),t)+lsim(U3,u31(1:k),t)+lsim(U4,u41(1:k),t);
%     u6=lsim(U,u61(1:k),t)+lsim(U2,u2(1:k),t)+lsim(U3,u31(1:k),t)+lsim(U4,u41(1:k),t)+lsim(U5,u51(1:k),t);
%     u7=lsim(U,u71(1:k),t)+lsim(U2,u2(1:k),t)+lsim(U3,u31(1:k),t)+lsim(U4,u41(1:k),t)+lsim(U5,u51(1:k),t)+lsim(U6,u61(1:k),t);
    
%     e2=lsim(G2,u2(1:k),t,x0);

%     e2(k)=(2-1/Nr1)*e2(k-1)+(1/Nr1-1)*e2(k-2)+r*Ts/Nr1*u2(k-2);%算出第二色的实际误差�?
%     e3=lsim(G3,u3(1:k),t)+lsim(G321,u2(1:k),t)-lsim(G322,u2(1:k),t);%算出第三色的实际误差�?
%     e4=lsim(G4,u4(1:k),t)+lsim(G421,u2(1:k),t)-lsim(G422,u2(1:k),t)+lsim(G431,u3(1:k),t)-lsim(G432,u3(1:k),t);
%     e5=lsim(G5,u5(1:k),t)+lsim(G521,u2(1:k),t)-lsim(G522,u2(1:k),t)+lsim(G531,u3(1:k),t)-lsim(G532,u3(1:k),t)+lsim(G541,u4(1:k),t)-lsim(G542,u4(1:k),t);
%     e6=lsim(G6,u6(1:k),t)+lsim(G621,u2(1:k),t)-lsim(G622,u2(1:k),t)+lsim(G631,u3(1:k),t)-lsim(G632,u3(1:k),t)+lsim(G641,u4(1:k),t)-lsim(G642,u4(1:k),t)+lsim(G651,u5(1:k),t)-lsim(G652,u5(1:k),t);
%     e7=lsim(G7,u7(1:k),t)+lsim(G721,u2(1:k),t)-lsim(G722,u2(1:k),t)+lsim(G731,u3(1:k),t)-lsim(G732,u3(1:k),t)+lsim(G741,u4(1:k),t)-lsim(G742,u4(1:k),t)+lsim(G751,u5(1:k),t)-lsim(G752,u5(1:k),t)+lsim(G761,u6(1:k),t)-lsim(G762,u6(1:k),t);



    e2(k)=(1-1/Nr1)*e2(k-1)+r/Nr1*u2(k-1);%算出第二色的实际误差�? 
    e3=lsim(G3,u3(1:k),t)+lsim(G321,u2(1:k),t)-lsim(G322,u2(1:k),t);%算出第三色的实际误差�?
    e4=lsim(G4,u4(1:k),t)+lsim(G421,u2(1:k),t)-lsim(G422,u2(1:k),t)+lsim(G431,u3(1:k),t)-lsim(G432,u3(1:k),t);
    e5=lsim(G5,u5(1:k),t)+lsim(G521,u2(1:k),t)-lsim(G522,u2(1:k),t)+lsim(G531,u3(1:k),t)-lsim(G532,u3(1:k),t)+lsim(G541,u4(1:k),t)-lsim(G542,u4(1:k),t);
    e6=lsim(G6,u6(1:k),t)+lsim(G621,u2(1:k),t)-lsim(G622,u2(1:k),t)+lsim(G631,u3(1:k),t)-lsim(G632,u3(1:k),t)+lsim(G641,u4(1:k),t)-lsim(G642,u4(1:k),t)+lsim(G651,u5(1:k),t)-lsim(G652,u5(1:k),t);
    e7=lsim(G7,u7(1:k),t)+lsim(G721,u2(1:k),t)-lsim(G722,u2(1:k),t)+lsim(G731,u3(1:k),t)-lsim(G732,u3(1:k),t)+lsim(G741,u4(1:k),t)-lsim(G742,u4(1:k),t)+lsim(G751,u5(1:k),t)-lsim(G752,u5(1:k),t)+lsim(G761,u6(1:k),t)-lsim(G762,u6(1:k),t);
    ek=[e2(k);e3(k);e4(k);e5(k);e6(k);e7(k)];
    %对优化初始�?进行修改，采用预测�?的后段作为下�?��的初始�?
%     u0=[ut(7:6*Np);ut(6*Np);ut(6*Np);ut(6*Np);ut(6*Np);ut(6*Np);ut(6*Np)];
    
end


plot(e2(1,2:200),'LineWidth',2,'DisplayName','E2完全解�?模型预测控制');
hold all
plot(e3(2:200,1),'LineWidth',2,'DisplayName','E3完全解�?模型预测控制');
plot(e4(2:200,1),'LineWidth',2,'DisplayName','E4完全解�?模型预测控制');
plot(e5(2:200,1),'LineWidth',2,'DisplayName','E5完全解�?模型预测控制');
plot(e6(2:200,1),'LineWidth',2,'DisplayName','E6完全解�?模型预测控制');
plot(e7(2:200,1),'LineWidth',2,'DisplayName','E7完全解�?模型预测控制');
% xlabel('�?);
% ylabel('误差�?.01mm)');


% plot(u2(1,3:200),'LineWidth',2,'DisplayName','u2完全解�?模型预测控制');
% hold all
% plot(u3(1,3:200),'LineWidth',2,'DisplayName','u3完全解�?模型预测控制');
% plot(u4(1,3:200),'LineWidth',2,'DisplayName','u4完全解�?模型预测控制');
% plot(u5(1,3:200),'LineWidth',2,'DisplayName','u5完全解�?模型预测控制');
% plot(u6(1,3:200),'LineWidth',2,'DisplayName','u6完全解�?模型预测控制');
% plot(u7(1,3:200),'LineWidth',2,'DisplayName','u7完全解�?模型预测控制');
% xlabel('�?);
% ylabel('控制量（0.01mm)');

toc%计时结束，自动计算此时与�?���?��tic之间的时�?